---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.RebarShapeArcReferenceType.Centerline
enum: Autodesk.Revit.DB.Structure.RebarShapeArcReferenceType
source: html/0552910e-83f5-70bb-4b87-14ce00d10bdb.htm
---
# Autodesk.Revit.DB.Structure.RebarShapeArcReferenceType.Centerline

Measure to the centerline of the bar.